{
  "topology_type": "Enablement",
  "north_star": "To provide a seamless and efficient local development experience that empowers developers to deliver high-quality software rapidly.",
  "mission": "To enhance the productivity and satisfaction of developers by providing robust tools, streamlined workflows, and comprehensive support for local development.",
  "vision": "To create a world-class local development environment that minimizes friction, maximizes efficiency, and accelerates innovation within the organization.",
  "stakeholders": {
    "core": {
      "description": "Individuals or teams directly benefiting from the DevX team's tools and support.",
      "value": "Product Engineering Teams, Backend Development Teams"
    },
    "supportive": {
      "description": "Individuals or teams that influence or support the DevX team's initiatives.",
      "value": "Platform Engineering Team, Delivery Team, Observability Team"
    },
    "peripheral": {
      "description": "External or less directly involved stakeholders who have an interest in the DevX team's outcomes.",
      "value": "InfoSec Team, FinOps Team, Operations Team"
    }
  },
  "kpis": [
    {
      "objective": "Reduce time to onboard new developers.",
      "justification": "Faster onboarding leads to quicker contributions and increased productivity.",
      "measurement": "Average time taken for new developers to set up their local development environment and complete their first commit.",
      "inbound": "Onboarding surveys, HR data",
      "outbound": "Monthly reports to Product Engineering and HR teams"
    },
    {
      "objective": "Increase developer satisfaction with local development tools.",
      "justification": "Higher satisfaction correlates with improved developer retention and productivity.",
      "measurement": "Developer satisfaction scores from regular internal surveys.",
      "inbound": "Internal developer surveys",
      "outbound": "Quarterly satisfaction reports to Engineering Leadership"
    },
    {
      "objective": "Decrease time taken to set up and run local development environments.",
      "justification": "Less setup time means more time for actual development and innovation.",
      "measurement": "Average setup time recorded from developer feedback and tool usage metrics.",
      "inbound": "Tool usage analytics, developer feedback forms",
      "outbound": "Bi-monthly analytics reports to the Development Teams"
    },
    {
      "objective": "Improve reliability and performance of local development tools.",
      "justification": "Reliable tools prevent disruptions and allow for smoother development processes.",
      "measurement": "Number of reported issues and average resolution time.",
      "inbound": "Issue tracking systems, support tickets",
      "outbound": "Monthly reliability and performance reports to Stakeholders"
    },
    {
      "objective": "Enhance collaboration between the DevX team and core stakeholders.",
      "justification": "Improved collaboration leads to better understanding of needs and more effective solutions.",
      "measurement": "Frequency and quality of collaboration meetings and joint projects.",
      "inbound": "Meeting logs, project tracking tools",
      "outbound": "Quarterly collaboration reports to all stakeholders"
    }
  ]
}